In [155]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline

In [156]:
data=pd.read_csv("Bengaluru_House_Data.csv")
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [157]:
data.shape

(13320, 9)

In [158]:
data.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [159]:
df2=data.drop(['availability','society'],axis="columns")
df2.head()

,area_type,location,size,total_sqft,bath,balcony,price
0,Super built-up Area,Electronic City Phase II,2 BHK,1056,2.0,1.0,39.07
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600,5.0,3.0,120.00
2,Built-up Area,Uttarahalli,3 BHK,1440,2.0,3.0,62.00
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521,3.0,1.0,95.00
4,Super built-up Area,Kothanur,2 BHK,1200,2.0,1.0,51.00

In [160]:
df2.isnull().sum()

area_type       0
location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [161]:
df2=df2.dropna()

In [162]:
df2['bhk']=df2['size'].apply(lambda x:int(x.split(' ')[0]))
df2=df2.drop(['size'],axis="columns")
df2.head()
df3=df2
df3.head()

,area_type,location,total_sqft,bath,balcony,price,bhk
0,Super built-up Area,Electronic City Phase II,1056,2.0,1.0,39.07,2
1,Plot Area,Chikka Tirupathi,2600,5.0,3.0,120.00,4
2,Built-up Area,Uttarahalli,1440,2.0,3.0,62.00,3
3,Super built-up Area,Lingadheeranahalli,1521,3.0,1.0,95.00,3
4,Super built-up Area,Kothanur,1200,2.0,1.0,51.00,2

In [163]:
def isfloat(x):
    try:
        x=float(x)
    except:
        return False
    return True

In [164]:
df3[~df3['total_sqft'].apply(isfloat)].head()

,area_type,location,total_sqft,bath,balcony,price,bhk
30,Super built-up Area,Yelahanka,2100 - 2850,4.0,0.0,186.000,4
122,Super built-up Area,Hebbal,3067 - 8156,4.0,0.0,477.000,4
137,Super built-up Area,8th Phase JP Nagar,1042 - 1105,2.0,0.0,54.005,2
165,Super built-up Area,Sarjapur,1145 - 1340,2.0,0.0,43.490,2
188,Super built-up Area,KR Puram,1015 - 1540,2.0,0.0,56.800,2

In [165]:
def convert(x):
    t=x.split('-')
    if(len(t)==2):
        s=(float(t[0])+float(t[1]))/2
        return s
    try:
        return float(x)
    except:
        None

In [166]:
df4=df3.copy()
df4['total_sqft']=df4['total_sqft'].apply(convert)
df4.loc[30]

area_type     Super built-up  Area
location                 Yelahanka
total_sqft                    2475
bath                             4
balcony                          0
price                          186
bhk                              4
Name: 30, dtype: object

In [167]:
df5=df4.copy()
df5['priceper']=df5['price']*100000/df5['total_sqft']
df5.head()

,area_type,location,total_sqft,bath,balcony,price,bhk,priceper
0,Super built-up Area,Electronic City Phase II,1056.0,2.0,1.0,39.07,2,3699.810606
1,Plot Area,Chikka Tirupathi,2600.0,5.0,3.0,120.00,4,4615.384615
2,Built-up Area,Uttarahalli,1440.0,2.0,3.0,62.00,3,4305.555556
3,Super built-up Area,Lingadheeranahalli,1521.0,3.0,1.0,95.00,3,6245.890861
4,Super built-up Area,Kothanur,1200.0,2.0,1.0,51.00,2,4250.000000

In [168]:
df5=df5[~(df5.total_sqft/df5.bhk <300)]
df5.shape

(12055, 8)

In [169]:
df6=df5.loc[(df5['location']=='Whitefield')]
df6.head()

,area_type,location,total_sqft,bath,balcony,price,bhk,priceper
5,Super built-up Area,Whitefield,1170.0,2.0,1.0,38.00,2,3247.863248
10,Super built-up Area,Whitefield,1800.0,2.0,2.0,70.00,3,3888.888889
11,Plot Area,Whitefield,2785.0,5.0,3.0,295.00,4,10592.459605
27,Built-up Area,Whitefield,1610.0,3.0,2.0,81.00,3,5031.055901
47,Super built-up Area,Whitefield,1459.0,2.0,1.0,94.82,2,6498.971899

In [182]:
def remove(df):
    df_out=pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.priceper)
        st=np.std(subdf.priceper)
        reduced_df=subdf[(subdf.priceper>(m-st)) & (subdf.priceper<=(m+st))]
        df_out=pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out

In [183]:
df7=remove(df6)
df7.shape

(464, 8)

In [184]:
df8=df7[df7.bath<=df7.bhk+2]
df8.shape

(464, 8)

In [187]:
df9=df8.drop(['priceper','area_type','location'],axis='columns')
df9.head()

   total_sqft  bath  balcony  price  bhk
0      1170.0   2.0      1.0  38.00    2
1      1800.0   2.0      2.0  70.00    3
2      1610.0   3.0      2.0  81.00    3
3      1459.0   2.0      1.0  94.82    2
4      2010.0   3.0      2.0  91.00    3

In [188]:
x=df9.drop('price',axis='columns')
x.head()

   total_sqft  bath  balcony  bhk
0      1170.0   2.0      1.0    2
1      1800.0   2.0      2.0    3
2      1610.0   3.0      2.0    3
3      1459.0   2.0      1.0    2
4      2010.0   3.0      2.0    3

In [189]:
y=df9.price
y.head()

0    38.00
1    70.00
2    81.00
3    94.82
4    91.00
Name: price, dtype: float64

In [190]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=10)

In [191]:
from sklearn.linear_model import LinearRegression
lg=LinearRegression()
lg.fit(x_train,y_train)
lg.score(x_test,y_test)

0.7963582443392736

In [192]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score
cv=ShuffleSplit(n_splits=5,test_size=0.2,random_state=0)
cross_val_score(LinearRegression(),x,y,cv=cv)

array([0.84757805, 0.91935336, 0.89255393, 0.85849119, 0.81969427])

In [193]:
from sklearn.model_selection import GridSearchCV
from sklearn.linear_model import Lasso
from sklearn.tree import DecisionTreeRegressor
def find_model(x,y):
    algos={
        'linear_regression':{
            'model':LinearRegression(),
            'params':{
                'normalize':[True,False]
            }
        },
        'lasso':{
            'model':Lasso(),
            'params':{
                'alpha':[1,2],
                'selection':['random','cyclic']
                
            }
        },
        'decisiontree':{
            'model':DecisionTreeRegressor(),
            'params':{
                'criterion':['mse','friedman_mse'],
                'splitter':['best','random']
            }
        }
    }
    scores=[]
    cv=ShuffleSplit(n_splits=5,test_size=0.2,random_state=0)
    for algo_name,config in algos.items():
        gs = GridSearchCV(config['model'],config['params'],cv=cv,return_train_score=False)
        gs.fit(x,y)
        scores.append({
            'model':algo_name,
            'bestscore':gs.best_score_,
            'bestparams':gs.best_params_
        })
    return pd.DataFrame(scores,columns=['model','bestscore','bestparams'])

In [194]:
find_model(x,y)

               model  bestscore                                bestparams
0  linear_regression   0.867534                      {'normalize': False}
1              lasso   0.875826       {'alpha': 2, 'selection': 'random'}
2       decisiontree   0.866366  {'criterion': 'mse', 'splitter': 'best'}

In [210]:
lasso=Lasso(alpha=2, selection='random')
lasso.fit(x_train,y_train)
lasso.score(x_test,y_test)

0.7949817608267917

In [212]:
def predict_price(sqft,bath,bhk):
    
    z=np.zeros(len(x.columns))
    z[0]=sqft
    z[1]=bath
    z[2]=bhk
    return lg.predict([z])[0]

In [213]:
predict_price(1000,2,2)

46.10611747268945

In [214]:
import pickle
with open('house_price_model.pickle','wb') as f:
    pickle.dump(lg,f)